{
    "seasons": [
        {
            "year": "2025",
            "name": "TBD",
            "description": "Season in progress...",
            "image": "robot-photo-2025.avif",
            "highlights": []
        },
        {
            "year": "2023-2024",
            "name": "CRESCENDO",
            "description": "Team 3637 The Daleks had an incredible 2024 season, sparked by innovation, creativity, and impact. Our efforts helped us earn the District Impact Award and the title of Competition Winners at Montgomery, alongside Team 1403 (Montgomery High School / Cougar Robotics) and Team 102 (Somerville High School / The Gearheads). A significant technical advancement for The Daleks this season was the implementation of a swerve drive system in their robot, \"Dalek Floyd.\" This innovative drivetrain provided enhanced maneuverability, allowing the robot to move seamlessly in any direction, which proved advantageous during competitions. Qualifying for the FIRST Robotics World Championship was also one of the major season highlights, reflecting the dedication and collaboration of every team member, mentor, and sponsor. With 1,500 outreach hours and over 10,000 lives impacted through 21 meaningful events, our dedication to our motto, \"Foster STEM Locally, Make a Difference Globally,\" has never been more evident than during the 2023-2024 season.",
            "image": "2024-robot-for-main-page.avif",
            "highlights": [
                "District Impact Award",
                "Competition Winners at Montgomery",
                "Swerve drive implementation",
                "World Championship qualification",
                "1,500 outreach hours",
                "10,000+ lives impacted"
            ]
        },
        {
            "year": "2022-2023",
            "name": "CHARGED UP",
            "description": "Team 3637 showcased resilience and innovation in the 2022-2023 season, emphasizing larger projects with global impact while staying true to FIRST's core values. Kicking off the season with a whimsical \"Team Magic\" session, the Daleks fused enchantment with team-building, setting the tone for a dynamic season. Future-focused initiatives included a research and development team mastering a swerve drive and an augmented CAD department, highlighting the team's commitment to progress. Mentors played a pivotal role in guiding students, and offering insights, reinforcing a collaborative spirit. Specifically, mentors affiliated with our sponsor, Nokia Bell Labs, invited us onsite to build and program our swerve drivebase. With over 1,300 volunteer hours across 13 events, the team's outreach efforts spanned school engagements, community events, and impactful drives, showcasing a dedication to community enrichment. Recognized by the New Jersey State Legislature, the Daleks mentored seven FIRST LEGO League teams, exemplifying their commitment to STEM education. Collaborations with other teams and the success of the Raritan Valley Science and Technology Showcase underscored the team's leadership and community engagement, leaving a lasting impact. As a diverse team, the Daleks' shared passion for STEM continued to influence our motto: \"Foster STEM Locally, Make a Difference Globally.\"",
            "image": "robot-photo2023.avif",
            "highlights": [
                "Swerve drive R&D",
                "Nokia Bell Labs partnership",
                "1,300+ volunteer hours",
                "7 FLL teams mentored",
                "NJ State Legislature recognition"
            ]
        },
        {
            "year": "2021-2022",
            "name": "RAPID REACT",
            "description": "Amidst the ongoing pandemic, we tackled the 2021-2022 Rapid React season with a focus on building stronger bonds. Adapting to virtual and in-person meetings, the team overcame challenges, adjusting to mask and social distancing protocols. Facing the Omicron variant, effective communication and regular check-ins ensured the team's unity. The season began with in-person sessions, fostering camaraderie and equipping new members with essential skills. Subteams underwent a significant shift, showcasing adaptability and innovation. Leadership emphasizes foundational teamwork and problem-solving. Notably, the Daleks secured the Entrepreneurship Award and Quality Award, adding to our legacy of excellence. Despite pandemic restrictions, the team maintained a commitment to outreach and participating in community events. The enduring bonds within Team 3637, exemplified by returning alumni mentors, show a season marked by resilience and success.",
            "image": "robot-photo-2022.avif",
            "highlights": [
                "Entrepreneurship Award",
                "Quality Award",
                "Pandemic adaptation",
                "Alumni mentor returns"
            ]
        },
        {
            "year": "2020-2021",
            "name": "INFINITE RECHARGE",
            "description": "This season proved to be uniquely challenging as the global COVID-19 pandemic disrupted our usual robotics activities. With the games structured differently, students faced the unprecedented choice of three distinct games, reflecting the adaptability and resilience of Team 3637. Despite the constraints, our team embraced the Innovation Challenge, emerging as semifinalists. In response to the altered landscape, we crafted a fitness link, conducting insightful interviews with fitness experts and showcasing our commitment to innovation. The pandemic necessitated creative approaches to team interaction, leading to the development of a business pitch delivered before a University of Virginia Kinesiology graduate class. Notably, our team's underclassmen who had been participating virtually were invited for in-person training as restrictions eased toward the end of the school year, fostering a sense of connection and mentorship. Though faced with challenges, Team 3637's dedication to FIRST principles and STEM education remained unwavering, marking the season with adaptability, innovation, and a commitment to fostering a collaborative and engaging robotics community.",
            "image": "robot-photo-2021.avif",
            "highlights": [
                "Innovation Challenge semifinalist",
                "Virtual team adaptation",
                "Business pitch to UVA"
            ]
        },
        {
            "year": "2019-2020",
            "name": "INFINITE RECHARGE",
            "description": "This year, we kicked off our action-packed preseason by attending the \"Ramp Riot\" competition in Ambler, PA, where our new members had their first taste of what Team 3637 was capable of. The biggest accomplishment of our preseason was the planning and execution of our first-ever FLL event, the \"BOT Bananza.\" Through our partnership with the Family Success Center (FSC), we were able to start and mentor one more FLL Jr. team, and through a new partnership with a local elementary school, we started and mentored three FLL Jr. teams. After kickoff began and our team started work on our robot, we hosted our annual sponsorship lunch and tour, expressing our gratitude and appreciation for our sponsors with food and presentations about our team. This February, we presented our team and our robot to our community through a meeting held by the HSMC (Hunterdon, Somerset, & Mercer Tri-County STEM Ecosystem). Along with our other outreach activities, we continue to spread the message of FIRST and STEM in our community, with 1,400 hours of outreach to date.",
            "image": "robot-photo-2020.avif",
            "highlights": [
                "First FLL event 'BOT Bananza'",
                "4 FLL Jr. teams mentored",
                "1,400 outreach hours"
            ]
        },
        {
            "year": "2018-2019",
            "name": "DESTINATION: DEEP SPACE",
            "description": "This season marked a significant year of growth for our team as we proudly expanded to include 76 members, all united by their enthusiasm for STEM. Initiating the year with a robust outreach effort, we participated in events such as the Flemington 4-H Fair and organized our very own FLL Jr. Expo. As a testament to our dedication, we have accumulated a total of 1100 outreach hours to date, with an additional 300 hours projected for the remainder of the season. Notably, our achievements extended beyond outreach efforts. This year, we proudly clinched the prestigious Chairman's Award at Montgomery and were honored with the Engineering Inspiration Award at Bridgewater. These accolades underscore our commitment to excellence and our unwavering pursuit of success in the field of robotics and STEM education.",
            "image": "robot-photo-2019.avif",
            "highlights": [
                "76 team members",
                "Chairman's Award at Montgomery",
                "Engineering Inspiration Award",
                "1,100+ outreach hours"
            ]
        },
        {
            "year": "2017-2018",
            "name": "POWER UP",
            "description": "The Daleks began pre-season with the continued success of our two FIRST LEGO League teams while also starting two FLL JR. teams, one FLL team in India and one in Boston. During pre-season, we made our second appearance with the robot at the 4H Fair, NJ State Fair, and Community Day, as well as held our inaugural Girl Scouts in STEM event. In addition to working hard on our competition robot, we completed over 1300 volunteer hours by the end of the year. Having taken on many technical and non-technical challenges this year so far, we are powering up for another wonderful season. We were honored to be awarded the Chairman's Award at the Montgomery Competition which recognized our work as a team over the past 5 years. We were also awarded the Engineering Inspiration Award at both the Mt. Olive Competition and the Mid-Atlantic District Championship in Lehigh. With this award, we were awarded a paid bid from NASA to attend the FIRST Worlds Championship in Detroit, making memories that we will cherish for a lifetime!",
            "image": "robot-photo-2018.avif",
            "highlights": [
                "Chairman's Award",
                "World Championship (NASA bid)",
                "FLL teams in India & Boston",
                "1,300+ volunteer hours"
            ]
        },
        {
            "year": "2016-2017",
            "name": "STEAMWORKS",
            "description": "The season got off to a great start with the continued success of our two FIRST LEGO League teams. During pre-season, we showcased our robot at the 4H Fair, Community Day, and the Chamber of Commerce's Business Expo. Shortly before kickoff, we were honored to be named as a runner-up for the Safety Animation Award. Also as a team, we completed over 1000 robotics outreach hours by the end of the year. During the composition season, we competed at Bridgewater, Montgomery, and the Mid-Atlantic District Championship at Lehigh University. We flew our way to the playoffs in both of our qualifying events. At Bridgewater, we won the \"District Event Finalist\" and the \"Creativity Award\" sponsored by Xerox. At Montgomery, we won the \"Imagery Award\" in honor of Jack Kamen. Finally, in the Mid-Atlantic District Championship, our hard work warranted us the \"Creativity Award\" once again. Our team is incredibly honored to have won these awards and continue to work hard to improve all aspects of our team for future years.",
            "image": "robot-photo-2017.avif",
            "highlights": [
                "District Event Finalist",
                "Creativity Award (2x)",
                "Imagery Award",
                "1,000+ outreach hours"
            ]
        },
        {
            "year": "2015-2016",
            "name": "STRONGHOLD",
            "description": "The Daleks catapulted into the 2015-2016 season. At the district competitions at Mount Olive and Montgomery High Schools, we ranked #3 and #2 respectively. The team qualified for the District competition for the second year in a row and attended the World Championships for the first time, where we won a Hard Hat Safety Pin. The team won the Imagery Award in honor of Jack Kamen at Mount Olive, and the Industrial Safety Award sponsored by Underwriters Laboratories at both Montgomery and the District Championships. The Daleks increased their outreach efforts in the fall of 2015 by forming and mentoring two FLL (FIRST LEGO League) teams in Hunterdon County. We maintained our work with two of the local elementary schools' LEGO clubs, tutored at the Family Success Center, as well as participated in Relay for Life. Our presence in the community became stronger than ever, and by extension, so did the vision of FIRST.",
            "image": "robot-photo-2016.avif",
            "highlights": [
                "First World Championship",
                "Ranked #2 & #3 at districts",
                "Industrial Safety Award (2x)",
                "2 FLL teams formed"
            ]
        },
        {
            "year": "2014-2015",
            "name": "RECYCLE RUSH",
            "description": "In 2015, the Daleks shined even brighter. We advanced to the District Championships for the first time since 2012, and we were also Finalists in a District Event for the first time in team history. We expanded our scouting team and created a scouting app for use by our team members in the stands, which syncs to our new custom pit server. Our great successes were due to many factors, one of which was Hunterdon Central's brand-new Robotics workroom. Team 3637's successes went beyond the technical aspects. Our outreach efforts expanded to new levels—some activities included running Robotics workshops at the county library and Family Success Center, assisting the LEGO Club at both Desmares and Barley Sheaf Elementary School, and forming a successful \"Relay for Life\" team.",
            "image": "robot-photo-2015.avif",
            "highlights": [
                "District Championship qualification",
                "District Event Finalist",
                "Custom scouting app",
                "New robotics workroom"
            ]
        },
        {
            "year": "2013-2014",
            "name": "AERIAL ASSIST",
            "description": "Team 3637 dove head first into the 2013-2014 season, and accomplished many feats. The Daleks made their first primarily offensive robot in less than six weeks, grew to a total of 45 members, and got a robotics class added to the Hunterdon Central curriculum. We competed in two Mid-Atlantic District Competitions, held at Mount Olive High School and Bridgewater-Raritan High School, and won the Chrysler Team Spirit Award at Mount Olive for our work in the community and overall team spirit. The team developed greatly in their skills and relationships.",
            "image": "robot-photo-2014.avif",
            "highlights": [
                "45 team members",
                "Robotics class added to curriculum",
                "Team Spirit Award"
            ]
        },
        {
            "year": "2012-2013",
            "name": "ULTIMATE ASCENT",
            "description": "The Daleks entered 2013 determined to try new things and reach new heights in the process. Our experimentation included a focus on the endgame challenge, a partnership with Team 869, and pre-season workshops in anticipation of the build season. While we didn't make it to the District Championships, we did achieve an impressive 30-point climb, and for our optimism and perseverance in the face of our many challenges, we brought home the Gracious Professionalism® award at the Bridgewater-Raritan District Competition. As in previous years, Team 3637 continued to grow, both in knowledge and experience as well as in membership.",
            "image": "robot-photo-2013.avif",
            "highlights": [
                "30-point climb achievement",
                "Gracious Professionalism Award",
                "Team 869 partnership"
            ]
        },
        {
            "year": "2011-2012",
            "name": "REBOUND RUMBLE",
            "description": "A larger organization than it had been in 2011, the Daleks reached new heights and new achievements. For the first time, we ranked in the top 50 teams after our first two competitions, qualifying to go to the MAR District Championships in Philadelphia. We also competed in our first off-season event (Brunswick Eruption) and were members of the winning alliance with Team 341 and Team 25.",
            "image": "robot-photo-2012.avif",
            "highlights": [
                "Top 50 ranking",
                "MAR District Championship",
                "Brunswick Eruption winners"
            ]
        },
        {
            "year": "2010-2011",
            "name": "LOGO MOTION",
            "description": "During our rookie season, we competed at the New Jersey Regional in Trenton. After winning a \"Rookie Inspiration Award\" in this initial season, the team realized that it needed access to a fully outfitted workspace and lobbied successfully to work out of a shop classroom at Central during the nights and weekends of build season. This initial success was the beginning of engineering and STEM extracurricular activities being offered at our high school.",
            "image": "robot-photo-2011.avif",
            "highlights": [
                "Rookie Inspiration Award",
                "First season",
                "Workspace established"
            ]
        }
    ]
}